In [1]:
import pandas as pd
import numpy as np

# Filtering and Sorting

#### Create `DataFrame`

In [2]:
forum_users = {
    'User ID': np.array([1, 2, 3, 4, 5]),
    'Username': ['bill', 'john', 'elly', 'fred', 'any'],
    'Age': [18, 35, 25, 38, None],
    'Joined date': pd.to_datetime(['2032-01-01', '2032-02-15', '2032-04-26', '2032-06-21', '2032-09-15']),
    'Total posts': [150, 230, 80, 420, 310],
    'Reputation': [500, 720, 200, 940, 500]
}

df = pd.DataFrame(forum_users)
df

   User ID Username   Age Joined date  Total posts  Reputation
0        1     bill  18.0  2032-01-01          150         500
1        2     john  35.0  2032-02-15          230         720
2        3     elly  25.0  2032-04-26           80         200
3        4     fred  38.0  2032-06-21          420         940
4        5      any   NaN  2032-09-15          310         500

## Filtering

In [3]:
df[['Username', 'Age']]

  Username   Age
0     bill  18.0
1     john  35.0
2     elly  25.0
3     fred  38.0
4      any   NaN

### Use `loc`

In [14]:
df.loc

#### Get serie (row from DataFrame)

In [6]:
df.loc[3]

User ID                          4
Username                      fred
Age                           38.0
Joined date    2032-06-21 00:00:00
Total posts                    420
Reputation                     940
Name: 3, dtype: object

In [7]:
type(df.loc[3])

pandas.core.series.Series

#### Get `DataFrame`

In [8]:
df.loc[2:3]

   User ID Username   Age Joined date  Total posts  Reputation
2        3     elly  25.0  2032-04-26           80         200
3        4     fred  38.0  2032-06-21          420         940

In [9]:
type(df.loc[2:3])

pandas.core.frame.DataFrame

In [11]:
df.loc[2:3, ['Username', 'Joined date', 'Reputation']]

  Username Joined date  Reputation
2     elly  2032-04-26         200
3     fred  2032-06-21         940

### Use `iloc`
It wors with indexes

In [15]:
df.iloc

In [16]:
df.iloc[3]

User ID                          4
Username                      fred
Age                           38.0
Joined date    2032-06-21 00:00:00
Total posts                    420
Reputation                     940
Name: 3, dtype: object

In [17]:
df.iloc[2:4]

   User ID Username   Age Joined date  Total posts  Reputation
2        3     elly  25.0  2032-04-26           80         200
3        4     fred  38.0  2032-06-21          420         940

In [21]:
df.iloc[2:4, ::-1]

   Reputation  Total posts Joined date   Age Username  User ID
2         200           80  2032-04-26  25.0     elly        3
3         940          420  2032-06-21  38.0     fred        4

### Filtering data by condition

In [23]:
df['Age'] >= 25

0    False
1     True
2     True
3     True
4    False
Name: Age, dtype: bool

In [22]:
df[df['Age'] >= 25]

   User ID Username   Age Joined date  Total posts  Reputation
1        2     john  35.0  2032-02-15          230         720
2        3     elly  25.0  2032-04-26           80         200
3        4     fred  38.0  2032-06-21          420         940

In [29]:
df[(df['Total posts'] >= 300) & (df['Age'] >= 25)]

   User ID Username   Age Joined date  Total posts  Reputation
3        4     fred  38.0  2032-06-21          420         940

In [31]:
df[(df['Total posts'] >= 400) | (df['Age'] >= 25)]

   User ID Username   Age Joined date  Total posts  Reputation
1        2     john  35.0  2032-02-15          230         720
2        3     elly  25.0  2032-04-26           80         200
3        4     fred  38.0  2032-06-21          420         940

### `isin`

In [33]:
df['Reputation'].isin([200, 500])

0     True
1    False
2     True
3    False
4     True
Name: Reputation, dtype: bool

In [35]:
df[df['Reputation'].isin([200, 500])]

   User ID Username   Age Joined date  Total posts  Reputation
0        1     bill  18.0  2032-01-01          150         500
2        3     elly  25.0  2032-04-26           80         200
4        5      any   NaN  2032-09-15          310         500

In [39]:
df[df['Total posts'].isin(range(200, 500))]

   User ID Username   Age Joined date  Total posts  Reputation
1        2     john  35.0  2032-02-15          230         720
3        4     fred  38.0  2032-06-21          420         940
4        5      any   NaN  2032-09-15          310         500

### date_range

In [41]:
date_range = pd.date_range(start='2032-03-01', end='2032-08-01')
date_range

DatetimeIndex(['2032-03-01', '2032-03-02', '2032-03-03', '2032-03-04',
               '2032-03-05', '2032-03-06', '2032-03-07', '2032-03-08',
               '2032-03-09', '2032-03-10',
               ...
               '2032-07-23', '2032-07-24', '2032-07-25', '2032-07-26',
               '2032-07-27', '2032-07-28', '2032-07-29', '2032-07-30',
               '2032-07-31', '2032-08-01'],
              dtype='datetime64[ns]', length=154, freq='D')

In [42]:
df[df['Joined date'].isin(date_range)]

   User ID Username   Age Joined date  Total posts  Reputation
2        3     elly  25.0  2032-04-26           80         200
3        4     fred  38.0  2032-06-21          420         940

## Sorting

In [44]:
df.sort_values(by='Age', ascending=True)

   User ID Username   Age Joined date  Total posts  Reputation
0        1     bill  18.0  2032-01-01          150         500
2        3     elly  25.0  2032-04-26           80         200
1        2     john  35.0  2032-02-15          230         720
3        4     fred  38.0  2032-06-21          420         940
4        5      any   NaN  2032-09-15          310         500

In [45]:
df.sort_values(by='Joined date', ascending=False)

   User ID Username   Age Joined date  Total posts  Reputation
4        5      any   NaN  2032-09-15          310         500
3        4     fred  38.0  2032-06-21          420         940
2        3     elly  25.0  2032-04-26           80         200
1        2     john  35.0  2032-02-15          230         720
0        1     bill  18.0  2032-01-01          150         500

In [68]:
selected_columns = ['User ID', 'Total posts', 'Reputation']
df[selected_columns]

   User ID  Total posts  Reputation
0        1          150         500
1        2          230         720
2        3           80         200
3        4          420         940
4        5          310         500

In [69]:
selected_columns = ['User ID', 'Total posts', 'Reputation']
df[selected_columns].sort_values(by=2, axis=1, ascending=False)
# by=2 it means by values in 2 row

   Reputation  Total posts  User ID
0         500          150        1
1         720          230        2
2         200           80        3
3         940          420        4
4         500          310        5